{
  "architectures": [
    "ChineseCLIPModel"
  ],
  "dtype": "float32",
  "initializer_factor": 1.0,
  "initializer_range": 0.02,
  "logit_scale_init_value": 2.6592,
  "model_type": "chinese_clip",
  "projection_dim": 512,
  "text_config": {
    "architectures": [
      "ChineseCLIPTextModel"
    ],
    "attention_probs_dropout_prob": 0.1,
    "bos_token_id": 0,
    "directionality": "bidi",
    "dtype": "float32",
    "eos_token_id": 2,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "initializer_factor": 1.0,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 512,
    "model_type": "chinese_clip_text_model",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "output_past": true,
    "pooler_fc_size": 768,
    "pooler_num_attention_heads": 12,
    "pooler_num_fc_layers": 3,
    "pooler_size_per_head": 128,
    "pooler_type": "first_token_transform",
    "position_embedding_type": "absolute",
    "type_vocab_size": 2,
    "use_cache": true,
    "vocab_size": 21128
  },
  "transformers_version": "4.57.6",
  "vision_config": {
    "attention_dropout": 0.0,
    "dropout": 0.0,
    "dtype": "float32",
    "hidden_act": "quick_gelu",
    "hidden_size": 768,
    "image_size": 224,
    "initializer_factor": 1.0,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-05,
    "model_type": "chinese_clip_vision_model",
    "num_attention_heads": 12,
    "num_channels": 3,
    "num_hidden_layers": 12,
    "patch_size": 16,
    "projection_dim": 512
  }
}
